In [267]:
import pandas as pd
import numpy as np
import os
import json

In [269]:
data_file = os.path.join("purchase_data.json")
data_file

'purchase_data.json'

In [270]:
pymoli_df = pd.read_json('purchase_data.json')
pymoli_df.head()

,Age,Gender,Item ID,Item Name,Price,SN
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46
2,34,Male,174,Primitive Blade,2.46,Assastnya25
3,21,Male,92,Final Critic,1.36,Pheusrical25
4,23,Male,63,Stormfury Mace,1.27,Aela59

In [271]:
#Player count

player_count = len(pymoli_df["SN"].value_counts())
player_count

573

In [272]:
#Purchasing Analysis
#Number of unique items
unique_items = len(pymoli_df["Item Name"].value_counts())
unique_items

179

In [273]:
#Average purchase price
average_pp = pymoli_df["Price"].mean()
average_pp

2.931192307692303

In [315]:
#Number of purchases.
number_of_purchases = pymoli_df["Item Name"].count()
number_of_purchases

780

In [275]:
#Total Revenue

total_revenue = pymoli_df["Price"].sum()
total_revenue

2286.3299999999963

In [277]:
#Number of purchases.
number_of_gender = pymoli_df["Gender"].value_counts()
number_of_gender

Male                     633
Female                   136
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [278]:
#Males count

where_tuple = (pymoli_df["Gender"]=="Male")
males = pymoli_df.loc[where_tuple,:]
males.head()

,Age,Gender,Item ID,Item Name,Price,SN
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46
2,34,Male,174,Primitive Blade,2.46,Assastnya25
3,21,Male,92,Final Critic,1.36,Pheusrical25
4,23,Male,63,Stormfury Mace,1.27,Aela59

In [279]:
male_count = len(males)
male_count

633

In [280]:
#Female count

where_tuple = (pymoli_df["Gender"]=="Female")
females = pymoli_df.loc[where_tuple,:]
females.head()

,Age,Gender,Item ID,Item Name,Price,SN
7,29,Female,169,"Interrogator, Blood Blade of the Queen",3.32,Iathenudil29
16,22,Female,123,Twilight's Carver,1.14,Sundista85
17,22,Female,59,"Lightning, Etcher of the King",1.65,Aenarap34
22,11,Female,11,Brimstone,2.52,Deural48
29,16,Female,45,Glinting Glass Edge,2.46,Phaedai25

#Female Count

where_tuple = (pymoli_df["Gender"]=="Female")
females = pymoli_df.loc[where_tuple,:]
females.head()

In [281]:
female_count = len(females)
female_count

136

In [282]:
#number of Other / Non-Disclosed

where_tuple = (pymoli_df["Gender"]=="Other / Non-Disclosed")
others = pymoli_df.loc[where_tuple,:]
others.head()

,Age,Gender,Item ID,Item Name,Price,SN
177,34,Other / Non-Disclosed,155,War-Forged Gold Deflector,3.73,Assassa38
209,33,Other / Non-Disclosed,157,"Spada, Etcher of Hatred",2.21,Frichistasta59
244,21,Other / Non-Disclosed,183,Dragon's Greatsword,2.36,Tyaerith73
267,33,Other / Non-Disclosed,65,Conqueror Adamantite Mace,1.96,Frichistasta59
276,12,Other / Non-Disclosed,128,"Blazeguard, Reach of Eternity",4.00,Aillycal84

In [283]:
others_count = len(others)
others_count

11

In [284]:
#sum of males, females and other
total_count = male_count + female_count + others_count

total_count

780

In [285]:
male_percent  = male_count / total_count * 100


male_percent

81.15384615384616

In [286]:
female_percent = female_count / total_count * 100

female_percent

17.435897435897434

In [287]:
others_percent = others_count / total_count * 100

others_percent

1.4102564102564104

In [288]:
Per = male_percent + female_percent + others_percent

Per

100.0

In [289]:
#Male average purchase price
male_ave = males["Price"].mean()
male_ave

2.9505213270142154

In [290]:
#Female average purchase price
female_ave = females["Price"].mean()
female_ave

2.815514705882352

In [291]:
#Others average purchase price
others_ave = others["Price"].mean()
others_ave

3.2490909090909086

In [292]:
#Male purchase value

male_pv = male_ave * male_count
male_pv

1867.6799999999985

In [293]:
#Female purchase value

female_pv = female_ave * female_count
female_pv

382.90999999999985

In [294]:
#Others purchase value

others_pv = others_ave * others_count
others_pv

35.739999999999995

In [316]:
#Male normalized total

nt_male = male_pv / male_count
nt_male

2.9505213270142154

In [317]:
#Female normalized total

nt_female = female_pv / female_count
nt_female

2.815514705882352

In [318]:
#Others normalized total

nt_others = others_pv / others_count
nt_others

3.2490909090909086

In [297]:
#Age breakdown
bins = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60,64,68,72,76,80,84,88,92,96,100]
pymoli_df["Age Group"] = pd.cut(pymoli_df["Age"], bins)
pymoli_df.head()

,Age,Gender,Item ID,Item Name,Price,SN,Age Group
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34,"(36, 40]"
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46,"(20, 24]"
2,34,Male,174,Primitive Blade,2.46,Assastnya25,"(32, 36]"
3,21,Male,92,Final Critic,1.36,Pheusrical25,"(20, 24]"
4,23,Male,63,Stormfury Mace,1.27,Aela59,"(20, 24]"

In [304]:
# Creating a group based off of the bins
age_groups = pymoli_df.groupby("Age Group")
age_groups.min().head()

,Age,Gender,Item ID,Item Name,Price,SN
Age Group,,,,,,
"(4, 8]",7.0,Female,10.0,"Alpha, Oath of Zeal",1.03,Eosurdru76
"(8, 12]",9.0,Female,11.0,"Aetherius, Boon of the Blessed",1.27,Aillycal84
"(12, 16]",13.0,Female,2.0,Abyssal Shard,1.21,Aeral97
"(16, 20]",17.0,Female,4.0,"Aetherius, Boon of the Blessed",1.03,Adairialis76
"(20, 24]",21.0,Female,1.0,Alpha,1.03,Aela59

In [299]:
Age_groups = pymoli_df.groupby("Age Group")
Age_groups.min().head()

,Age,Gender,Item ID,Item Name,Price,SN
Age Group,,,,,,
"(4, 8]",7.0,Female,10.0,"Alpha, Oath of Zeal",1.03,Eosurdru76
"(8, 12]",9.0,Female,11.0,"Aetherius, Boon of the Blessed",1.27,Aillycal84
"(12, 16]",13.0,Female,2.0,Abyssal Shard,1.21,Aeral97
"(16, 20]",17.0,Female,4.0,"Aetherius, Boon of the Blessed",1.03,Adairialis76
"(20, 24]",21.0,Female,1.0,Alpha,1.03,Aela59

In [300]:
pur_count = Age_groups["Age Group"].count()
AvePurPrice = Age_groups["Price"].mean()
Pur_Value = pur_count * AvePurPrice
Norm_Total = pur_count / AvePurPrice

In [303]:
#Age Demographic Table

age_demo = pd.DataFrame({"Purchase Count":pur_count,
                          "Average Purchase Price":AvePurPrice,
                          "Total Purchase Value":Pur_Value,
                          "Normalized Total":Norm_Total
                        
})
    
age_demo.head()

,Average Purchase Price,Normalized Total,Purchase Count,Total Purchase Value
Age Group,,,,
"(4, 8]",2.788182,7.890447,22,61.34
"(8, 12]",3.385417,7.089231,24,81.25
"(12, 16]",2.745862,31.684039,87,238.89
"(16, 20]",2.907019,55.383202,161,468.03
"(20, 24]",2.924748,81.374535,238,696.09

In [332]:
# Creating a group based off of the bins
spenders_groups = pymoli_df.groupby("SN")
spenders_groups.min().head()

,Age,Gender,Item ID,Item Name,Price,Age Group
SN,,,,,,
Adairialis76,20,Male,44,Bonecarvin Battle Axe,2.46,"(16, 20]"
Aduephos78,37,Male,79,"Alpha, Oath of Zeal",1.36,"(36, 40]"
Aeduera68,26,Male,39,"Betrayal, Whisper of Grieving Widows",1.16,"(24, 28]"
Aela49,25,Male,44,Bonecarvin Battle Axe,2.46,"(24, 28]"
Aela59,23,Male,63,Stormfury Mace,1.27,"(20, 24]"

In [336]:
pur_count = spenders_groups["SN"].count()
AvePurPrice = spenders_groups["Price"].mean()
Pur_Value = spenders_groups["Price"].sum()

In [335]:
#Top Spenders

TopSpender = pd.DataFrame({"Purchase Count":pur_count,
                          "Average Purchase Price":AvePurPrice,
                          "Total Purchase Value":Pur_Value,
                          })
    
TopSpender.head()

              Average Purchase Price  Purchase Count  Total Purchase Value
SN
Adairialis76                2.460000               1                  2.46
Aduephos78                  2.233333               3                  6.70
Aeduera68                   1.933333               3                  5.80
Aela49                      2.460000               1                  2.46
Aela59                      1.270000               1                  1.27

In [339]:
#Sorting for top spenders

TopFive = TopSpender.sort_values("Total Purchase Value", ascending=False)
TopFive.head(5)

             Average Purchase Price  Purchase Count  Total Purchase Value
SN
Undirrala66                3.412000               5                 17.06
Saedue76                   3.390000               4                 13.56
Mindimnya67                3.185000               4                 12.74
Haellysu29                 4.243333               3                 12.73
Eoda93                     3.860000               3                 11.58

In [348]:
#5 most popular items

pop_items = pymoli_df.groupby("Item ID")
pop_items.min().head()

         Age Gender           Item Name  Price            SN Age Group
Item ID
0         30   Male            Splinter   1.82  Chadadarya31  (28, 32]
1         21   Male            Crucifer   2.28     Assylla81  (20, 24]
2         15   Male             Verdict   3.40         Ila44  (12, 16]
3         15   Male        Phantomlight   1.79   Iaralrgue74  (12, 16]
4         20   Male  Bloodlord's Fetish   2.28   Thryallym62  (16, 20]

In [342]:
pur_countA = pop_items["Item ID"].count()
AvePurPriceA = pop_items["Price"].mean()
Pur_ValueA = pop_items["Price"].sum()

In [346]:
#Popular Items

PopularItems = pd.DataFrame({"Purchase Count":pur_countA,
                          "Item Price": AvePurPriceA,
                          "Total Purchase Value":Pur_ValueA,                    
                           })
                          
    
PopularItems.head()

         Item Price  Purchase Count  Total Purchase Value
Item ID
0              1.82               1                  1.82
1              2.28               4                  9.12
2              3.40               1                  3.40
3              1.79               1                  1.79
4              2.28               1                  2.28

In [350]:
#Top five popular items 
TopFivePopularItems = PopularItems.sort_values("Purchase Count", ascending=False)
TopFivePopularItems.head(5)

         Item Price  Purchase Count  Total Purchase Value
Item ID
39             2.35              11                 25.85
84             2.23              11                 24.53
31             2.07               9                 18.63
175            1.24               9                 11.16
13             1.49               9                 13.41

In [351]:
#Top five profitable items 
TopFiveProfitableItems = PopularItems.sort_values("Total Purchase Value", ascending=False)
TopFiveProfitableItems.head(5)

         Item Price  Purchase Count  Total Purchase Value
Item ID
34             4.14               9                 37.26
115            4.25               7                 29.75
32             4.95               6                 29.70
103            4.87               6                 29.22
107            3.61               8                 28.88